sergiistetsiuk/robotics-sumo-esp32/src/main.cpp
#include <Arduino.h>
#include <Adafruit_NeoPixel.h>
#include <Adafruit_VL53L0X.h>
#include <Update.h>
#include <WebServer.h>
#include <WiFi.h>
#include <Wire.h>

// Replace these with your Wi-Fi network credentials.
const char *WIFI_SSID = "stemlab118";
const char *WIFI_PASSWORD = "123118118";

WebServer server(80);

const uint8_t BTN_RUN_PIN = 4;
const unsigned long BUTTON_DEBOUNCE_MS = 50;
const unsigned long SENSOR_LOG_INTERVAL_MS = 1000;
const unsigned long START_SEQUENCE_INTERVAL_MS = 1000;
const unsigned long START_SEQUENCE_DURATION_MS = 5000;
const uint8_t WS2812B_PIN = 33;
const uint8_t WS2812B_LED_COUNT = 3;
const uint8_t I2C_SDA = 21;
const uint8_t I2C_SCL = 22;
const uint8_t XSHUT_RIGHT = 25;
const uint8_t XSHUT_FRONT = 26;
const uint8_t XSHUT_LEFT = 27;
const uint8_t ADDR_RIGHT = 0x30;
const uint8_t ADDR_FRONT = 0x31;
const uint8_t ADDR_LEFT = 0x32;
const uint8_t MOTOR_LEFT_PWM_PIN = 17;
const uint8_t MOTOR_LEFT_DIR_PIN = 16;
const uint8_t MOTOR_RIGHT_PWM_PIN = 19;
const uint8_t MOTOR_RIGHT_DIR_PIN = 18;
const uint32_t pwmFreq = 5000;
const uint8_t pwmResolution = 8;
uint8_t searchSpeedPercent = 1;
uint8_t attackSpeedPercent = 10;
const uint8_t MOTOR_MAX_DUTY = 255;
const uint8_t MOTOR_STOP_DUTY = 255;
const uint8_t MOTOR_LEFT_PWM_CHANNEL = 0;
const uint8_t MOTOR_RIGHT_PWM_CHANNEL = 1;
const uint8_t LINE_SENSOR_PIN = 23;
const uint8_t LINE_SENSOR_ACTIVE_STATE = HIGH;

Adafruit_NeoPixel ws2812b(WS2812B_LED_COUNT, WS2812B_PIN, NEO_BRG + NEO_KHZ800);
Adafruit_VL53L0X sensorRight;
Adafruit_VL53L0X sensorFront;
Adafruit_VL53L0X sensorLeft;

const size_t MAX_LOG_LINES = 80;
String logLines[MAX_LOG_LINES];
size_t logLineCount = 0;
size_t logWriteIndex = 0;

bool otaSuccess = false;
String otaMessage;

bool lastRunButtonReading = HIGH;
bool stableRunButtonState = HIGH;
unsigned long lastRunButtonChangeMs = 0;
bool projectRunning = false;
bool projectStarting = false;
unsigned long startSequenceStartedMs = 0;
int8_t lastStartSequenceStep = -1;
unsigned long lastSensorLogMs = 0;
bool sensorRightReady = false;
bool sensorFrontReady = false;
bool sensorLeftReady = false;

void setupWiFi();
void setupWebOTA();
void addLog(const String &message);
String getUptime();
void handleRoot();
void handleLogs();
void handleStatus();
void handleClearLogs();
void handleReset();
void handleFirmwareUpload();
void setWs2812bColor(uint8_t red, uint8_t green, uint8_t blue);
void setupDistanceSensors();
bool setupDistanceSensor(Adafruit_VL53L0X &sensor, const String &name, uint8_t xshutPin, uint8_t address);
void logDistanceSensors();
String readDistanceSensor(Adafruit_VL53L0X &sensor, bool ready);
void setupMotors();
void attachMotorPwm(uint8_t pin, uint8_t channel);
void writeMotorPwm(uint8_t pin, uint8_t channel, uint8_t duty);
uint8_t speedPercentToDuty(uint8_t percent);
void setMotorsSpeed(uint8_t duty);
void setMotorsSpeedPercent(uint8_t percent);
void setupLineSensor();
String readLineSensorStatus();
void setProjectRunning(bool running);
void beginStartSequence();
void updateStartSequence();
void setupProject();
void loopProject();

String htmlEscape(const String &text)
{
  String escaped;
  escaped.reserve(text.length());

  for (size_t i = 0; i < text.length(); i++)
  {
    const char c = text.charAt(i);
    switch (c)
    {
    case '&':
      escaped += F("&amp;");
      break;
    case '<':
      escaped += F("&lt;");
      break;
    case '>':
      escaped += F("&gt;");
      break;
    case '"':
      escaped += F("&quot;");
      break;
    case '\'':
      escaped += F("&#39;");
      break;
    default:
      escaped += c;
      break;
    }
  }

  return escaped;
}

String jsonEscape(const String &text)
{
  String escaped;
  escaped.reserve(text.length());

  for (size_t i = 0; i < text.length(); i++)
  {
    const char c = text.charAt(i);
    switch (c)
    {
    case '\\':
      escaped += F("\\\\");
      break;
    case '"':
      escaped += F("\\\"");
      break;
    case '\n':
      escaped += F("\\n");
      break;
    case '\r':
      escaped += F("\\r");
      break;
    case '\t':
      escaped += F("\\t");
      break;
    default:
      if (static_cast<uint8_t>(c) < 0x20)
      {
        escaped += ' ';
      }
      else
      {
        escaped += c;
      }
      break;
    }
  }

  return escaped;
}

String getLogText()
{
  String output;
  const size_t start = (logLineCount == MAX_LOG_LINES) ? logWriteIndex : 0;

  for (size_t i = 0; i < logLineCount; i++)
  {
    const size_t index = (start + i) % MAX_LOG_LINES;
    output += logLines[index];
    output += '\n';
  }

  return output;
}

void setupWiFi()
{
  WiFi.mode(WIFI_STA);
  WiFi.begin(WIFI_SSID, WIFI_PASSWORD);

  Serial.print(F("Connecting to Wi-Fi"));

  while (WiFi.status() != WL_CONNECTED)
  {
    delay(500);
    Serial.print('.');
  }

  Serial.println();
  addLog("Wi-Fi connected");
  addLog("IP address: " + WiFi.localIP().toString());
}

void setupWebOTA()
{
  server.on("/", HTTP_GET, handleRoot);
  server.on("/logs", HTTP_GET, handleLogs);
  server.on("/status", HTTP_GET, handleStatus);
  server.on("/clear-logs", HTTP_POST, handleClearLogs);
  server.on("/reset", HTTP_POST, handleReset);
  server.on(
      "/update", HTTP_POST,
      []()
      {
        const int statusCode = otaSuccess ? 200 : 500;
        const String statusClass = otaSuccess ? "success" : "error";
        const String title = otaSuccess ? "Firmware uploaded successfully" : "Firmware upload failed";
        const String details = otaSuccess ? "The ESP32 will reboot now. This page will return to the main interface automatically."
                                          : otaMessage;

        String page = F("<!doctype html><html><head><meta charset='utf-8'>"
                        "<meta name='viewport' content='width=device-width,initial-scale=1'>");

        page += F("<title>ESP32 OTA</title><style>"
                  "body{margin:0;min-height:100vh;display:grid;place-items:center;background:#f3f6fb;color:#172033;font-family:Arial,sans-serif}"
                  ".box{width:min(92vw,560px);background:#fff;border:1px solid #d9e1ef;border-radius:8px;padding:28px;box-shadow:0 18px 45px rgba(20,34,58,.12)}"
                  "h1{margin:0 0 12px;font-size:24px}.success{color:#147a45}.error{color:#b42318}"
                  "p{line-height:1.5}.btn{display:inline-block;margin-top:14px;padding:11px 16px;border-radius:6px;background:#1f6feb;color:#fff;text-decoration:none}"
                  "</style></head><body><main class='box'>");
        page += "<h1 class='" + statusClass + "'>" + htmlEscape(title) + "</h1>";
        page += "<p>" + htmlEscape(details) + "</p>";
        page += F("<a class='btn' href='/'>Back to dashboard</a></main>");

        if (otaSuccess)
        {
          page += F("<script>"
                    "let attempts=0;"
                    "function goHomeWhenReady(){"
                    "attempts++;"
                    "fetch('/',{cache:'no-store'})"
                    ".then(function(response){if(response.ok){location.href='/';return;}throw new Error('not ready');})"
                    ".catch(function(){setTimeout(goHomeWhenReady,1500);});"
                    "}"
                    "setTimeout(goHomeWhenReady,5000);"
                    "</script>");
        }

        page += F("</body></html>");
        server.send(statusCode, "text/html", page);

        if (otaSuccess)
        {
          addLog("OTA upload completed successfully; rebooting");
          delay(1000);
          ESP.restart();
        }
      },
      handleFirmwareUpload);

  server.begin();
  addLog("Web OTA server started on http://" + WiFi.localIP().toString() + "/");
  addLog("Sketch size: " + String(ESP.getSketchSize()) + " bytes");
  addLog("Free OTA space: " + String(ESP.getFreeSketchSpace()) + " bytes");
}

