sergiistetsiuk/robotics-sumo-esp32/src/main.cpp
void addLog(const String &message)
{
  const String line = "[" + getUptime() + "] " + message;

  Serial.println(line);
  logLines[logWriteIndex] = line;
  logWriteIndex = (logWriteIndex + 1) % MAX_LOG_LINES;

  if (logLineCount < MAX_LOG_LINES)
  {
    logLineCount++;
  }
}

void clearLogs()
{
  for (size_t i = 0; i < MAX_LOG_LINES; i++)
  {
    logLines[i] = "";
  }

  logLineCount = 0;
  logWriteIndex = 0;
}

String getUptime()
{
  const uint64_t totalSeconds = millis() / 1000;
  const uint32_t days = totalSeconds / 86400;
  const uint8_t hours = (totalSeconds % 86400) / 3600;
  const uint8_t minutes = (totalSeconds % 3600) / 60;
  const uint8_t seconds = totalSeconds % 60;

  char buffer[32];

  if (days > 0)
  {
    snprintf(buffer, sizeof(buffer), "%lud %02u:%02u:%02u", static_cast<unsigned long>(days), hours, minutes, seconds);
  }
  else
  {
    snprintf(buffer, sizeof(buffer), "%02u:%02u:%02u", hours, minutes, seconds);
  }

  return String(buffer);
}

void handleRoot()
{
  const String ipAddress = WiFi.localIP().toString();

  String page = F(R"rawliteral(
<!doctype html>
<html lang="en">
<head>
  <meta charset="utf-8">
  <meta name="viewport" content="width=device-width, initial-scale=1">
  <title>ESP32 Web OTA</title>
  <style>
    :root {
      color-scheme: light;
      --bg: #f4f7fb;
      --panel: #ffffff;
      --text: #172033;
      --muted: #5f6f86;
      --line: #dbe3ef;
      --primary: #1f6feb;
      --primary-dark: #174ea6;
      --danger: #b42318;
      --success: #147a45;
      --log-bg: #101828;
      --log-text: #d6e4ff;
    }

    * {
      box-sizing: border-box;
    }

    body {
      margin: 0;
      min-height: 100vh;
      background: var(--bg);
      color: var(--text);
      font-family: Arial, Helvetica, sans-serif;
    }

    .shell {
      width: min(1120px, calc(100% - 28px));
      margin: 0 auto;
      padding: 28px 0;
    }

    header {
      display: flex;
      align-items: flex-start;
      justify-content: space-between;
      gap: 18px;
      margin-bottom: 18px;
    }

    h1 {
      margin: 0 0 6px;
      font-size: clamp(28px, 5vw, 42px);
      line-height: 1.05;
      letter-spacing: 0;
    }

    .subtitle {
      margin: 0;
      color: var(--muted);
      font-size: 15px;
    }

    .status-grid {
      display: grid;
      grid-template-columns: repeat(2, minmax(130px, 1fr));
      gap: 10px;
      min-width: min(100%, 330px);
    }

    .status-card {
      background: var(--panel);
      border: 1px solid var(--line);
      border-radius: 8px;
      padding: 13px 14px;
    }

    .status-card span {
      display: block;
      color: var(--muted);
      font-size: 12px;
      text-transform: uppercase;
      letter-spacing: .06em;
      margin-bottom: 7px;
    }

    .status-card strong {
      display: block;
      overflow-wrap: anywhere;
      font-size: 17px;
    }

    .panel {
      background: var(--panel);
      border: 1px solid var(--line);
      border-radius: 8px;
      overflow: hidden;
      box-shadow: 0 18px 45px rgba(20, 34, 58, .10);
    }

    .tabs {
      display: flex;
      gap: 0;
      border-bottom: 1px solid var(--line);
      background: #eef3fa;
    }

    .tab-button {
      appearance: none;
      border: 0;
      border-right: 1px solid var(--line);
      background: transparent;
      color: var(--muted);
      cursor: pointer;
      font: inherit;
      font-weight: 700;
      padding: 15px 18px;
      min-width: 150px;
    }

    .tab-button.active {
      background: var(--panel);
      color: var(--primary-dark);
    }

    .tab-content {
      display: none;
      padding: 18px;
    }

    .tab-content.active {
      display: block;
    }

    .log-toolbar {
      display: flex;
      justify-content: space-between;
      gap: 12px;
      align-items: center;
      margin-bottom: 12px;
    }

    .log-toolbar p {
      color: var(--muted);
      margin: 0;
      font-size: 14px;
    }

    .actions {
      display: flex;
      flex-wrap: wrap;
      gap: 10px;
      justify-content: flex-end;
    }

    .action-button {
      appearance: none;
      border: 1px solid var(--line);
      border-radius: 6px;
      background: #fff;
      color: var(--text);
      cursor: pointer;
      font: inherit;
      font-weight: 700;
      padding: 10px 13px;
    }

    .action-button:hover {
      border-color: #9fb0c8;
      background: #f8fbff;
    }

    .action-button:disabled {
      cursor: wait;
      opacity: .65;
    }

    .action-button.danger {
      border-color: #f0b8b2;
      color: var(--danger);
    }

    .action-button.danger:hover {
      background: #fff5f4;
    }

    pre {
      width: 100%;
      min-height: 420px;
      max-height: 62vh;
      overflow: auto;
      margin: 0;
      padding: 16px;
      border-radius: 8px;
      background: var(--log-bg);
      color: var(--log-text);
      font: 14px/1.45 "SFMono-Regular", Consolas, "Liberation Mono", monospace;
      white-space: pre-wrap;
      word-break: break-word;
    }

    form {
      display: grid;
      gap: 14px;
      max-width: 680px;
    }

    label {
      display: grid;
      gap: 8px;
      color: var(--muted);
      font-weight: 700;
    }

    input[type="file"] {
      width: 100%;
      border: 1px dashed #aab8cc;
      border-radius: 8px;
      padding: 18px;
      background: #f8fbff;
      color: var(--text);
    }

    button[type="submit"] {
      justify-self: start;
      min-width: 170px;
      border: 0;
      border-radius: 6px;
      background: var(--primary);
      color: #fff;
      cursor: pointer;
      font: inherit;
      font-weight: 700;
      padding: 12px 18px;
    }

    button[type="submit"]:hover {
      background: var(--primary-dark);
    }

    .notice {
      margin: 0;
      color: var(--muted);
      line-height: 1.5;
    }

    .message {
      min-height: 24px;
      font-weight: 700;
    }

    .message.error {
      color: var(--danger);
    }

    .message.success {
      color: var(--success);
    }

    @media (max-width: 720px) {
      header {
        display: grid;
      }

      .status-grid {
        grid-template-columns: 1fr;
      }

      .tabs {
        display: grid;
        grid-template-columns: 1fr 1fr;
      }

      .tab-button {
        min-width: 0;
        padding-inline: 10px;
      }

