sergiistetsiuk/robotics-sumo-esp32/src/main.cpp
      .log-toolbar {
        display: grid;
      }

      pre {
        min-height: 360px;
      }
    }
  </style>
</head>
<body>
  <main class="shell">
    <header>
      <div>
        <h1>ESP32 Web OTA</h1>
        <p class="subtitle">Wireless firmware updates and live board diagnostics.</p>
      </div>
      <section class="status-grid" aria-label="Device status">
        <div class="status-card">
          <span>IP Address</span>
          <strong id="ipAddress">)rawliteral");

  page += htmlEscape(ipAddress);

  page += F(R"rawliteral(</strong>
        </div>
        <div class="status-card">
          <span>Uptime</span>
          <strong id="uptime">)rawliteral");

  page += htmlEscape(getUptime());

  page += F(R"rawliteral(</strong>
        </div>
      </section>
    </header>

    <section class="panel">
      <nav class="tabs" aria-label="Main tabs">
        <button class="tab-button active" type="button" data-tab="logs">Board Logs</button>
        <button class="tab-button" type="button" data-tab="upload">Firmware Upload</button>
      </nav>

      <section id="tab-logs" class="tab-content active">
        <div class="log-toolbar">
          <p>Live board logs update automatically.</p>
          <div class="actions">
            <button id="clearLogsButton" class="action-button" type="button">Clear Logs</button>
            <button id="resetButton" class="action-button danger" type="button">Reset ESP32</button>
          </div>
        </div>
        <pre id="logs">Loading logs...</pre>
      </section>

      <section id="tab-upload" class="tab-content">
        <form id="uploadForm" method="POST" action="/update" enctype="multipart/form-data">
          <label>
            Firmware .bin file
            <input id="firmwareFile" type="file" name="firmware" accept=".bin,application/octet-stream" required>
          </label>
          <p class="notice">Upload a PlatformIO firmware binary. The board will reboot automatically after a successful update.</p>
          <button type="submit">Upload Firmware</button>
          <div id="uploadMessage" class="message" role="status"></div>
        </form>
      </section>
    </section>
  </main>

  <script>
    const buttons = document.querySelectorAll('.tab-button');
    const logsEl = document.getElementById('logs');
    const uptimeEl = document.getElementById('uptime');
    const ipAddressEl = document.getElementById('ipAddress');
    const uploadForm = document.getElementById('uploadForm');
    const firmwareFile = document.getElementById('firmwareFile');
    const uploadMessage = document.getElementById('uploadMessage');
    const clearLogsButton = document.getElementById('clearLogsButton');
    const resetButton = document.getElementById('resetButton');

    buttons.forEach((button) => {
      button.addEventListener('click', () => {
        const tab = button.dataset.tab;

        buttons.forEach((item) => item.classList.toggle('active', item === button));
        document.querySelectorAll('.tab-content').forEach((content) => {
          content.classList.toggle('active', content.id === `tab-${tab}`);
        });
      });
    });

    async function refreshLogs() {
      try {
        const response = await fetch('/logs', { cache: 'no-store' });
        const text = await response.text();
        const shouldStickToBottom = logsEl.scrollTop + logsEl.clientHeight >= logsEl.scrollHeight - 24;
        logsEl.textContent = text || 'No logs yet.';

        if (shouldStickToBottom) {
          logsEl.scrollTop = logsEl.scrollHeight;
        }
      } catch (error) {
        logsEl.textContent = 'Unable to load logs.';
      }
    }

    async function refreshStatus() {
      try {
        const response = await fetch('/status', { cache: 'no-store' });
        const status = await response.json();
        uptimeEl.textContent = status.uptime;
        ipAddressEl.textContent = status.ip;
      } catch (error) {
        uptimeEl.textContent = 'Unavailable';
      }
    }

    uploadForm.addEventListener('submit', (event) => {
      const file = firmwareFile.files[0];
      uploadMessage.className = 'message';
      uploadMessage.textContent = '';

      if (!file || !file.name.toLowerCase().endsWith('.bin')) {
        event.preventDefault();
        uploadMessage.classList.add('error');
        uploadMessage.textContent = 'Please choose a .bin firmware file.';
        return;
      }

      uploadMessage.classList.add('success');
      uploadMessage.textContent = 'Uploading firmware. Keep this page open.';
    });

    clearLogsButton.addEventListener('click', async () => {
      clearLogsButton.disabled = true;

      try {
        await fetch('/clear-logs', { method: 'POST', cache: 'no-store' });
        await refreshLogs();
      } finally {
        clearLogsButton.disabled = false;
      }
    });

    resetButton.addEventListener('click', async () => {
      if (!confirm('Reset the ESP32 now?')) {
        return;
      }

      resetButton.disabled = true;

      try {
        await fetch('/reset', { method: 'POST', cache: 'no-store' });
        logsEl.textContent = 'Reset requested. Reconnecting...';
        setTimeout(() => location.reload(), 8000);
      } catch (error) {
        setTimeout(() => location.reload(), 8000);
      }
    });

    refreshLogs();
    refreshStatus();
    setInterval(refreshLogs, 1000);
    setInterval(refreshStatus, 1000);
  </script>
</body>
</html>
)rawliteral");

  server.send(200, "text/html", page);
}

void handleLogs()
{
  server.send(200, "text/plain", getLogText());
}

void handleClearLogs()
{
  clearLogs();
  addLog("Logs cleared from web interface");
  server.send(200, "text/plain", "Logs cleared");
}

void handleReset()
{
  addLog("Reset requested from web interface");
  server.send(200, "text/plain", "Reset requested");
  delay(500);
  ESP.restart();
}

void handleStatus()
{
  String response = "{";
  response += "\"ip\":\"" + jsonEscape(WiFi.localIP().toString()) + "\",";
  response += "\"uptime\":\"" + jsonEscape(getUptime()) + "\",";
  response += "\"rssi\":" + String(WiFi.RSSI()) + ",";
  response += "\"freeHeap\":" + String(ESP.getFreeHeap());
  response += "}";

