sergiistetsiuk/robotics-sumo-esp32/src/main.cpp
  server.send(200, "application/json", response);
}

void handleFirmwareUpload()
{
  HTTPUpload &upload = server.upload();

  if (upload.status == UPLOAD_FILE_START)
  {
    otaSuccess = false;
    otaMessage = "";

    const String filename = upload.filename;

    if (!filename.endsWith(".bin"))
    {
      otaMessage = "Only .bin firmware files are accepted.";
      addLog("OTA rejected: " + otaMessage);
      return;
    }

    addLog("OTA upload started: " + filename);
    addLog("Free OTA space before upload: " + String(ESP.getFreeSketchSpace()) + " bytes");

    const size_t freeSketchSpace = ESP.getFreeSketchSpace();
    const size_t updateSpace = freeSketchSpace > 0x1000 ? (freeSketchSpace - 0x1000) & 0xFFFFF000 : 0;

    if (updateSpace == 0)
    {
      otaMessage = "No OTA update partition is available. Flash once by USB with an OTA partition table.";
      addLog("OTA begin failed: " + otaMessage);
    }
    else if (!Update.begin(updateSpace))
    {
      otaMessage = Update.errorString();
      addLog("OTA begin failed: " + otaMessage);
    }
  }
  else if (upload.status == UPLOAD_FILE_WRITE)
  {
    if (otaMessage.length() == 0)
    {
      const size_t written = Update.write(upload.buf, upload.currentSize);

      if (written != upload.currentSize)
      {
        otaMessage = Update.errorString();
        addLog("OTA write failed: " + otaMessage);
      }
    }
  }
  else if (upload.status == UPLOAD_FILE_END)
  {
    if (otaMessage.length() == 0 && Update.end(true))
    {
      otaSuccess = true;
      otaMessage = "Upload complete.";
      addLog("OTA upload size: " + String(upload.totalSize) + " bytes");
    }
    else
    {
      otaSuccess = false;

      if (otaMessage.length() == 0)
      {
        otaMessage = Update.errorString();
      }

      addLog("OTA end failed: " + otaMessage);
    }
  }
  else if (upload.status == UPLOAD_FILE_ABORTED)
  {
    Update.abort();
    otaSuccess = false;
    otaMessage = "Upload was aborted.";
    addLog("OTA aborted");
  }
}

void setWs2812bColor(uint8_t red, uint8_t green, uint8_t blue)
{
  const uint32_t color = ws2812b.Color(red, green, blue);

  for (uint8_t i = 0; i < WS2812B_LED_COUNT; i++)
  {
    ws2812b.setPixelColor(i, color);
  }

  ws2812b.show();
}

void setupDistanceSensors()
{
  Wire.begin(I2C_SDA, I2C_SCL);

  pinMode(XSHUT_RIGHT, OUTPUT);
  pinMode(XSHUT_FRONT, OUTPUT);
  pinMode(XSHUT_LEFT, OUTPUT);

  digitalWrite(XSHUT_RIGHT, LOW);
  digitalWrite(XSHUT_FRONT, LOW);
  digitalWrite(XSHUT_LEFT, LOW);
  delay(10);

  addLog("I2C initialized on SDA " + String(I2C_SDA) + ", SCL " + String(I2C_SCL));

  sensorRightReady = setupDistanceSensor(sensorRight, "right", XSHUT_RIGHT, ADDR_RIGHT);
  sensorFrontReady = setupDistanceSensor(sensorFront, "front", XSHUT_FRONT, ADDR_FRONT);
  sensorLeftReady = setupDistanceSensor(sensorLeft, "left", XSHUT_LEFT, ADDR_LEFT);
}

bool setupDistanceSensor(Adafruit_VL53L0X &sensor, const String &name, uint8_t xshutPin, uint8_t address)
{
  digitalWrite(xshutPin, HIGH);
  delay(10);

  if (!sensor.begin(address, false, &Wire))
  {
    addLog("VL53L0X " + name + " init failed on XSHUT GPIO " + String(xshutPin));
    return false;
  }

  addLog("VL53L0X " + name + " initialized at address 0x" + String(address, HEX));
  return true;
}

String readDistanceSensor(Adafruit_VL53L0X &sensor, bool ready)
{
  if (!ready)
  {
    return "not ready";
  }

  VL53L0X_RangingMeasurementData_t measurement;
  sensor.rangingTest(&measurement, false);

  if (measurement.RangeStatus == 4)
  {
    return "out of range";
  }

  return String(measurement.RangeMilliMeter) + " mm";
}

void logDistanceSensors()
{
  const String rightValue = readDistanceSensor(sensorRight, sensorRightReady);
  const String frontValue = readDistanceSensor(sensorFront, sensorFrontReady);
  const String leftValue = readDistanceSensor(sensorLeft, sensorLeftReady);

  addLog("VL53L0X distances - right: " + rightValue + ", front: " + frontValue + ", left: " + leftValue);
  addLog("Line sensor status: " + readLineSensorStatus());
}

void setupMotors()
{
  pinMode(MOTOR_LEFT_PWM_PIN, OUTPUT);
  pinMode(MOTOR_RIGHT_PWM_PIN, OUTPUT);
  pinMode(MOTOR_LEFT_DIR_PIN, OUTPUT);
  pinMode(MOTOR_RIGHT_DIR_PIN, OUTPUT);

  digitalWrite(MOTOR_LEFT_PWM_PIN, HIGH);
  digitalWrite(MOTOR_RIGHT_PWM_PIN, HIGH);
  digitalWrite(MOTOR_LEFT_DIR_PIN, LOW);
  digitalWrite(MOTOR_RIGHT_DIR_PIN, LOW);

  attachMotorPwm(MOTOR_LEFT_PWM_PIN, MOTOR_LEFT_PWM_CHANNEL);
  attachMotorPwm(MOTOR_RIGHT_PWM_PIN, MOTOR_RIGHT_PWM_CHANNEL);
  setMotorsSpeed(0);

  addLog("Motors initialized: left PWM GPIO " + String(MOTOR_LEFT_PWM_PIN) + ", left DIR GPIO " + String(MOTOR_LEFT_DIR_PIN));
  addLog("Motors initialized: right PWM GPIO " + String(MOTOR_RIGHT_PWM_PIN) + ", right DIR GPIO " + String(MOTOR_RIGHT_DIR_PIN));
}

void attachMotorPwm(uint8_t pin, uint8_t channel)
{
#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
  ledcAttach(pin, pwmFreq, pwmResolution);
#else
  ledcSetup(channel, pwmFreq, pwmResolution);
  ledcAttachPin(pin, channel);
#endif
}

void writeMotorPwm(uint8_t pin, uint8_t channel, uint8_t duty)
{
#if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
  ledcWrite(pin, duty);
#else
  ledcWrite(channel, duty);
#endif
}

uint8_t speedPercentToDuty(uint8_t percent)
{
  const uint8_t limitedPercent = percent > 100 ? 100 : percent;

  return (static_cast<uint16_t>(limitedPercent) * MOTOR_MAX_DUTY) / 100;
}

void setMotorsSpeed(uint8_t duty)
{
  const uint8_t invertedDuty = MOTOR_STOP_DUTY - duty;

  writeMotorPwm(MOTOR_LEFT_PWM_PIN, MOTOR_LEFT_PWM_CHANNEL, invertedDuty);
  writeMotorPwm(MOTOR_RIGHT_PWM_PIN, MOTOR_RIGHT_PWM_CHANNEL, invertedDuty);
}

void setMotorsSpeedPercent(uint8_t percent)
{
  setMotorsSpeed(speedPercentToDuty(percent));
}

void setupLineSensor()
{
  pinMode(LINE_SENSOR_PIN, INPUT);
  addLog("Line sensor initialized on GPIO " + String(LINE_SENSOR_PIN));
  addLog("Line sensor status: " + readLineSensorStatus());
}

String readLineSensorStatus()
{
  const uint8_t rawState = digitalRead(LINE_SENSOR_PIN);
  const String stateText = rawState == HIGH ? "HIGH" : "LOW";
  const String lineText = rawState == LINE_SENSOR_ACTIVE_STATE ? "line detected" : "no line";

  return lineText + " (raw " + stateText + ")";
}

void setProjectRunning(bool running)
{
  projectStarting = false;
  projectRunning = running;

  if (projectRunning)
  {
    setWs2812bColor(255, 0, 0);
    digitalWrite(MOTOR_LEFT_DIR_PIN, HIGH);
    digitalWrite(MOTOR_RIGHT_DIR_PIN, HIGH);
    setMotorsSpeedPercent(searchSpeedPercent);
    lastSensorLogMs = 0;
    addLog("Project status: running");
    addLog("WS2812B color: red");
    addLog("Motors search speed: " + String(searchSpeedPercent) + "% active-low PWM");
  }
  else
  {
    setMotorsSpeed(0);
    digitalWrite(MOTOR_LEFT_DIR_PIN, LOW);
    digitalWrite(MOTOR_RIGHT_DIR_PIN, LOW);
    setWs2812bColor(0, 255, 0);
    addLog("Project status: stopped");
    addLog("WS2812B color: green");
    addLog("Motors stopped");
  }
}

void beginStartSequence()
{
  setProjectRunning(false);
  projectStarting = true;
  startSequenceStartedMs = millis();
  lastStartSequenceStep = -1;
  addLog("Start sequence: 5 second red/green countdown");
  updateStartSequence();
}

