sergiistetsiuk/robotics-sumo-esp32/src/main.cpp
void updateStartSequence()
{
  if (!projectStarting)
  {
    return;
  }

  const unsigned long elapsedMs = millis() - startSequenceStartedMs;

  if (elapsedMs >= START_SEQUENCE_DURATION_MS)
  {
    addLog("Start sequence complete");
    setProjectRunning(true);
    return;
  }

  const int8_t currentStep = elapsedMs / START_SEQUENCE_INTERVAL_MS;

  if (currentStep == lastStartSequenceStep)
  {
    return;
  }

  lastStartSequenceStep = currentStep;

  if (currentStep % 2 == 0)
  {
    setWs2812bColor(255, 0, 0);
    addLog("Start sequence color: red");
  }
  else
  {
    setWs2812bColor(0, 255, 0);
    addLog("Start sequence color: green");
  }
}

void setupProject()
{
  pinMode(BTN_RUN_PIN, INPUT_PULLUP);
  lastRunButtonReading = digitalRead(BTN_RUN_PIN);
  stableRunButtonState = lastRunButtonReading;

  ws2812b.begin();
  ws2812b.setBrightness(60);

  setupLineSensor();
  setupDistanceSensors();
  setProjectRunning(false);

  // Add your own project initialization code here.
  addLog("BTN_RUN_PIN initialized on GPIO " + String(BTN_RUN_PIN));
  addLog("WS2812B initialized on GPIO " + String(WS2812B_PIN) + " with " + String(WS2812B_LED_COUNT) + " LEDs");
  addLog("Project setup complete");
}

void loopProject()
{
  const bool currentReading = digitalRead(BTN_RUN_PIN);

  if (currentReading != lastRunButtonReading)
  {
    lastRunButtonChangeMs = millis();
    lastRunButtonReading = currentReading;
  }

  if ((millis() - lastRunButtonChangeMs) > BUTTON_DEBOUNCE_MS && currentReading != stableRunButtonState)
  {
    stableRunButtonState = currentReading;

    if (stableRunButtonState == HIGH)
    {
      addLog("BTN_RUN_PIN released");

      if (projectRunning || projectStarting)
      {
        setProjectRunning(false);
      }
      else
      {
        beginStartSequence();
      }
    }
  }

  updateStartSequence();

  if (projectRunning && (lastSensorLogMs == 0 || millis() - lastSensorLogMs >= SENSOR_LOG_INTERVAL_MS))
  {
    lastSensorLogMs = millis();
    logDistanceSensors();
  }

  // Add your own repeated project logic here.
}

void setup()
{
  Serial.begin(115200);
  setupMotors();
  setupWiFi();
  setupWebOTA();
  setupProject();
}

void loop()
{
  server.handleClient();
  loopProject();
}
